scottmsilver/precor-9.3x/hardware/Esp32Tap/firmware/esp32/sdkconfig.defaults
# Esp32Tap sdkconfig.defaults — PLAN.md normative key set (phase 1).
#
# The exact sdkconfig gate stays mandatory on every flashed build:
#   grep CONFIG_ESP_TASK_WDT_PANIC=y sdkconfig
# build_safety_manifest.py fail-closes on the WDT / panic / no-halt /
# brownout keys below for any Emulate-capable production artifact.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# --- FreeRTOS tick: 1000 Hz (1 ms tick), NOT the IDF default 100 Hz.
# The serial engine's 5 ms loop cadence uses vTaskDelay(pdMS_TO_TICKS(5));
# at 100 Hz that truncates to vTaskDelay(0) — a busy spin that starves
# app_main (the other supervised tasks are never created) and the core-0
# idle task, ending in a 2 s task-WDT panic -> silent reboot, forever.
# Guarded by a static_assert in main/serial_engine_task.cpp so a
# regression here is a compile error, not a boot loop.
CONFIG_FREERTOS_HZ=1000

# --- Task WDT: 2 s, panic-on-stall (mandatory; the IDF default merely
# logs a warning and never releases the relay) ---
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=2
CONFIG_ESP_TASK_WDT_PANIC=y

# --- Panic action: immediate silent reboot; nothing may delay the reset
# (core dumps, apptrace, halt/debug modes are forbidden) ---
CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT=y
# CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS is a hidden/default key;
# if the generated sdkconfig emits it, it must be 0 (PLAN).
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y
CONFIG_APPTRACE_DEST_NONE=y
CONFIG_APPTRACE_DEST_UART_NONE=y
# OCD-aware panic handling is a debug/halt path — forbidden in an
# Emulate-capable build.
# CONFIG_ESP_DEBUG_OCDAWARE is not set

# --- Brownout detection: enabled. The SELECTOR is deliberately left at
# the IDF default here (CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7, ~2.51 V):
# PLAN requires the highest documented ESP32-S3 threshold STRICTLY BELOW
# the measured minimum +3V3 of the exact production artifact, and that
# measurement does not exist yet (project status: HOLD — see
# ../PLAN.md "Exact production artifact identity"). Selecting a number
# now would be pretending to know min +3V3. The deferred selection is
# fail-closed, not forgotten: ../build_safety_manifest.py REFUSES to
# emit a production manifest unless the configured selector matches the
# supplied physical +3V3 measurement (selector numbers are inverse to
# voltage — e.g. measured 3.05 V min -> level 3 ≈ 2.98 V, not level 7),
# so no Emulate-capable artifact can ship on this placeholder.
CONFIG_ESP_BROWNOUT_DET=y

# --- Main task stack: parser buffers are static/member-allocated, but
# keep headroom per the QEMU-validated KvPair stack constraint ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- M4 (radios) keys — LISTED, NOT ENABLED: the BT/WiFi components are
# not part of the phase-1 build, and enabling these without them fails
# the build. Uncomment at M4 with the NimBLE/WiFi components.
# M4: CONFIG_BT_NIMBLE_PINNED_TO_CORE=1
# M4: CONFIG_BT_CTRL_PINNED_TO_CORE_1=y
# M4: CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y
# M4: CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
# M4: CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
